###  Results for `terraform plan` on `root_path` 

<details>
<summary>Show output</summary>

```diff
data.aws_ssm_parameter.subnet_private_1b: Reading...
data.aws_ssm_parameter.subnet_private_1c: Reading...
data.aws_ssm_parameter.vpc: Reading...
data.aws_ssm_parameter.subnet_public_1a: Reading...
data.aws_ssm_parameter.subnet_public_1b: Reading...
data.aws_ssm_parameter.subnet_private_1a: Reading...
data.aws_ssm_parameter.subnet_public_1c: Reading...
data.aws_ssm_parameter.subnet_private_1a: Read complete after 0s [id=/arq-EKS/vpc/subnet_private_1a]
data.aws_ssm_parameter.subnet_public_1b: Read complete after 0s [id=/arq-EKS/vpc/subnet_public_1b]
data.aws_ssm_parameter.subnet_public_1c: Read complete after 0s [id=/arq-EKS/vpc/subnet_public_1c]
data.aws_ssm_parameter.subnet_private_1c: Read complete after 0s [id=/arq-EKS/vpc/subnet_private_1c]
data.aws_ssm_parameter.subnet_public_1a: Read complete after 0s [id=/arq-EKS/vpc/subnet_public_1a]
data.aws_ssm_parameter.vpc: Read complete after 0s [id=/arq-EKS/vpc/vpc_id]
data.aws_ssm_parameter.subnet_private_1b: Read complete after 0s [id=/arq-EKS/vpc/subnet_private_1b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.on_demand will be created
  + resource "aws_autoscaling_group" "on_demand" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 3
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 4
      + metrics_granularity              = "1Minute"
      + min_size                         = 2
      + name                             = (known after apply)
      + name_prefix                      = "ecs-cluster-on-demand"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (sensitive value)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "AmazonECSManaged"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "ecs-cluster-on-demand"
        }
    }

  # aws_autoscaling_group.spots will be created
  + resource "aws_autoscaling_group" "spots" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 3
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 4
      + metrics_granularity              = "1Minute"
      + min_size                         = 2
      + name                             = (known after apply)
      + name_prefix                      = "ecs-cluster-spots"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (sensitive value)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "AmazonECSManaged"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "ecs-cluster-spots"
        }
    }

  # aws_ecs_capacity_provider.on_demand will be created
  + resource "aws_ecs_capacity_provider" "on_demand" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "ecs-cluster-on-demand"
      + tags_all = (known after apply)

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_draining               = (known after apply)
          + managed_termination_protection = (known after apply)

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = 10
              + minimum_scaling_step_size = 1
              + status                    = "ENABLED"
              + target_capacity           = 90
            }
        }
    }

  # aws_ecs_capacity_provider.spots will be created
  + resource "aws_ecs_capacity_provider" "spots" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "ecs-cluster-spots"
      + tags_all = (known after apply)

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_draining               = (known after apply)
          + managed_termination_protection = (known after apply)

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = 10
              + minimum_scaling_step_size = 1
              + status                    = "ENABLED"
              + target_capacity           = 90
            }
        }
    }

  # aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "ecs-cluster"
      + tags_all = (known after apply)

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_cluster_capacity_providers.main will be created
  + resource "aws_ecs_cluster_capacity_providers" "main" {
      + capacity_providers = [
          + "ecs-cluster-on-demand",
          + "ecs-cluster-spots",
        ]
      + cluster_name       = "ecs-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "ecs-cluster-on-demand"
          + weight            = 100
        }
    }

  # aws_iam_instance_profile.main will be created
  + resource "aws_iam_instance_profile" "main" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ecs-cluster-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ecs-cluster-instance-profile"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.main will be created
  + resource "aws_iam_role" "main" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-cluster-instance-profile"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ec2_role will be created
  + resource "aws_iam_role_policy_attachment" "ec2_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "ecs-cluster-instance-profile"
    }

  # aws_iam_role_policy_attachment.ec2_ssm will be created
  + resource "aws_iam_role_policy_attachment" "ec2_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2RoleforSSM"
      + role       = "ecs-cluster-instance-profile"
    }

  # aws_launch_template.on_demand will be created
  + resource "aws_launch_template" "on_demand" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-0e86e20dae9224db8"
      + instance_type          = "c6a.large"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ecs-cluster-on-demand"
      + tags_all               = (known after apply)
      + update_default_version = true
      + user_data              = "IyEvYmluL2Jhc2gKCmVjaG8gRUNTX0NMVVNURVI9ZWNzLWNsdXN0ZXIgPj4gL2V0Yy9lY3MvZWNzLmNvbmZpZwo="
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + iops        = (known after apply)
              + throughput  = (known after apply)
              + volume_size = 50
              + volume_type = "gp3"
            }
        }

      + iam_instance_profile {
          + name = "ecs-cluster-instance-profile"
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "ecs-cluster-on-demand"
            }
        }
    }

  # aws_launch_template.spots will be created
  + resource "aws_launch_template" "spots" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-0e86e20dae9224db8"
      + instance_type          = "c6a.large"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ecs-cluster-spots"
      + tags_all               = (known after apply)
      + update_default_version = true
      + user_data              = "IyEvYmluL2Jhc2gKCmVjaG8gRUNTX0NMVVNURVI9ZWNzLWNsdXN0ZXIgPj4gL2V0Yy9lY3MvZWNzLmNvbmZpZwo="
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + iops        = (known after apply)
              + throughput  = (known after apply)
              + volume_size = 50
              + volume_type = "gp3"
            }
        }

      + iam_instance_profile {
          + name = "ecs-cluster-instance-profile"
        }

      + instance_market_options {
          + market_type = "spot"

          + spot_options {
              + max_price   = "0.30"
              + valid_until = (known after apply)
            }
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "ecs-cluster-on-demand"
            }
        }
    }

  # aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "ecs-cluster-ingress"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (sensitive value)
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.main will be created
  + resource "aws_lb_listener" "main" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "LinuxTips"
              + status_code  = "200"
            }
        }
    }

  # aws_security_group.lb will be created
  + resource "aws_security_group" "lb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ecs-cluster-load-balancer"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (sensitive value)
    }

  # aws_security_group.main will be created
  + resource "aws_security_group" "main" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ecs-cluster"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (sensitive value)
    }

  # aws_security_group_rule.ingress_443 will be created
  + resource "aws_security_group_rule" "ingress_443" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Liberando trafego na porta 443"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.ingress_80 will be created
  + resource "aws_security_group_rule" "ingress_80" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Liberando trafego na porta 80"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # aws_security_group_rule.subnet_ranges will be created
  + resource "aws_security_group_rule" "subnet_ranges" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Liberando trafego para a VPC"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

Plan: 19 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>